app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:name, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Gabriel"], ["body", "First comment!"], ["post_id", 1], ["created_at", "2017-06-02 20:04:40.802711"], ["updated_at", "2017-06-02 20:04:40.802711"]]